# Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.

a = float(input("Введите длину куба: "))

print("Объём куба", a ** 3)
print("Площадь боковой поверхности", 4 * a ** 2)
