# Создать строку равную первым пяти символам введенной строки.

print(input("Введите вашу строку: ")[:5])
