# Создать строку равную третьему символу введенной строки

print(input("Введите вашу строку: ")[2])
