# Создать строку равную предпоследнему символу введенной строки.

print(input("Введите вашу строку: ")[-2])
