# Создать строку равную введенной строкe без последних двух символов.

print(input("Введите вашу строку: ")[:-2])
